packages/fxa-auth-server/test/local/payments/fixtures/stripe/subscription_cancelled.json

{
  "id": "sub_GWSkxxni5LtLCN",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1578671671,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": 1582720052,
  "collection_method": "charge_automatically",
  "created": 1578671671,
  "current_period_end": 1582732471,
  "current_period_start": 1582646071,
  "customer": "cus_GWSknodAeAs3d9",
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "discount": null,
  "ended_at": 1582720052,
  "invoice_customer_balance_settings": {
    "consume_applied_balance_on_void": true
  },
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_GWSkMeUMweYbNO",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1578671671,
        "metadata": {},
        "plan": {
          "id": "plan_GWSd22z7QP8x3M",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 699,
          "amount_decimal": "699",
          "billing_scheme": "per_unit",
          "created": 1578671266,
          "currency": "usd",
          "interval": "day",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": "daily",
          "product": "prod_FaoUiGcVfoGaLA",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "subscription": "sub_GWSkxxni5LtLCN",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_GWSkxxni5LtLCN"
  },
  "latest_invoice": "in_1GG5kCKb9q6OnNsLyXgkZN0e",
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "plan": {
    "id": "plan_GWSd22z7QP8x3M",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 699,
    "amount_decimal": "699",
    "billing_scheme": "per_unit",
    "created": 1578671266,
    "currency": "usd",
    "interval": "day",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": "daily",
    "product": "prod_FaoUiGcVfoGaLA",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1578671671,
  "start_date": 1578671671,
  "status": "canceled",
  "tax_percent": null,
  "trial_end": null,
  "trial_start": null
}
